УТ/src/DataProcessors/CRM_МастерРегистрацииОбращения/CRM_МастерРегистрацииОбращения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>CRM_МастерРегистрацииОбращения</name>
</mdclass:DataProcessor>

УТ/src/Enums/CRM_ВариантыНазначенияОтветственного/CRM_ВариантыНазначенияОтветственного.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>CRM_ВариантыНазначенияОтветственного</name>
  <enumValues>
    <name>ТекущийПользователь</name>
  </enumValues>
  <enumValues>
    <name>ПерсональнаяНастройка</name>
  </enumValues>
  <enumValues>
    <name>МенеджерКлиента</name>
  </enumValues>
  <enumValues>
    <name>РольСценария</name>
  </enumValues>
  <enumValues>
    <name>ОтветственныйОбращения</name>
  </enumValues>
</mdclass:Enum>

УТ/src/Catalogs/CRM_СостоянияИнтересов/CRM_СостоянияИнтересов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_СостоянияИнтересов</name>
  <comment>Сценарии продаж</comment>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>БлокируемыеРеквизитыИнтереса</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>БлокируемыеРеквизитыИнтересаПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВероятностьСделки</name>
    <comment>Вероятность сделки</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидДела</name>
    <type>
      <types>CatalogRef.CRM_ВидыДелВзаимодействий</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСостояния</name>
    <type>
      <types>EnumRef.CRM_ВидыСостоянияИнтереса</types>
    </type>
  </attributes>
  <attributes>
    <name>ДобавитьВероятностьВПредставлениеСостояния</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗавершатьЗапланированныеАктивности</name>
    <type>
      <types>EnumRef.CRM_ЗавершаемыеТипыАктивности</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗавершатьСвязанныеДиалоги</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Завершено</name>
    <comment>Состояние завершения интереса</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПредопределенногоЭлемента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИндексЦвета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИнтерактивноеПланированиеАктивностей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьЧекЛист</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияСостояния</name>
    <type>
      <types>EnumRef.CRM_КатегорииСостоянийПоддержки</types>
    </type>
  </attributes>
  <attributes>
    <name>НеСоздаватьЗадачу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбязательноеПланированиеАктивности</name>
    <type>
      <types>EnumRef.CRM_ПланируемыеТипыАктивности</types>
    </type>
  </attributes>
  <attributes>
    <name>ОжидаемыйСрокНаЭтапе</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтборЗавершаемыхАктивностей</name>
    <type>
      <types>EnumRef.CRM_ОтборыЗавершаемыхАктивностей</types>
    </type>
  </attributes>
  <attributes>
    <name>Офис</name>
    <type>
      <types>CatalogRef.CRM_ОфисыКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверкаВыполненияЧекЛиста</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверяемыеРеквизитыИнтереса</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверяемыеРеквизитыИнтересаПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьРолевуюАдресацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РольОтветственного</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
    </type>
  </attributes>
  <attributes>
    <name>УказыватьДостигнутыйРезультат</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоПоддержка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_ОбязательноеЗаполнениеКлиента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_УказаниеОжидаемойВыручки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТипыУслуг</name>
    <attributes>
      <name>ТипУслуги</name>
      <type>
        <types>CatalogRef.CRM_ТипУслуги</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Подразделения</name>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТипыОбращений</name>
    <attributes>
      <name>ТипОбращения</name>
      <type>
        <types>CatalogRef.CRM_ТипыОбращений</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЧекЛист</name>
    <attributes>
      <name>ОписаниеЗадачи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ/src/Catalogs/СтруктураПредприятия/СтруктураПредприятия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтруктураПредприятия</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>ТекущийРуководитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантОбособленногоУчетаТоваров</name>
    <type>
      <types>EnumRef.ВариантыОбособленногоУчетаТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>Источник</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СоответствуетСтруктуреЮридическихЛиц</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводственноеПодразделение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.Календари</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнтервалПланирования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачалоИнтервалаПланирования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеИнтервалаПланирования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>УправлениеМаршрутнымиЛистами</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполнениеДоступностиДляРасписанияРЦКоличествоИнтервалов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполнениеДоступностиДляРасписанияРЦНапоминаниеДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполнениеДоступностиДляГрафикаПроизводстваКоличествоИнтервалов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособПооперационногоУправления</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполнениеДоступностиДляГрафикаПроизводстваНапоминаниеДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеДиспетчер</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьСерииНоменклатуры</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНаРегистрациюВыполнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНаРегистрациюВыполненияЕдИзм</name>
    <type>
      <types>EnumRef.ЕдиницыИзмеренияВремени</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьСебестоимостьПоСериям</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводствоПоЗаказам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводствоБезЗаказов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяСписаниеЗатратНаВыпуск</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособПолученияПолуфабрикатов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПооперационноеУправление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьМатериалыВОперациях</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьВыходныеИзделияВОперациях</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПооперационноеПланирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_МаксимальноеКоличествоБалловВДень</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Офис</name>
    <comment>Офис компании</comment>
    <type>
      <types>CatalogRef.CRM_ОфисыКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ПериодРасчетаПотенциала</name>
    <type>
      <types>EnumRef.CRM_ПериодыРасчетаПотенциала</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ПроцентПревышенияКоличестваБаллов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ФормулаРасчетаПотенциала</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодичностьОформленияВыработки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьКТУ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьТарифныеСтавки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОтработанноеВремя</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьБригадныеНаряды</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПерсональныеНаряды</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособНастройкиГрафикаРаботы</name>
    <type>
      <types>EnumRef.СпособыНастройкиГрафикаРаботыПодразделений</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьСменныеЗадания</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПроизводственныеУчастки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодИсточника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыОрганизацийПодразделений</types>
    </type>
  </attributes>
  <attributes>
    <name>КоэффициентРастяженияГрафикаПроизводства</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ГрафикиРаботы</name>
    <attributes>
      <name>ГрафикРаботы</name>
      <type>
        <types>CatalogRef.Календари</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CRM_ТипУслуги</name>
    <comment>Тип услуги</comment>
    <attributes>
      <name>ТипУслуги</name>
      <comment>Тип услуги</comment>
      <type>
        <types>CatalogRef.CRM_ТипУслуги</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ/src/DataProcessors/CRM_МастерРегистрацииОбращения/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьДоступныеСценарииПродаж(Знач ПараметрыСценариев) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДоступныеСценарии = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	
	"ВЫБРАТЬ
	|	СостоянияИнтересов.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ДоступныеПоТипуОбращенияСостояния
	|ИЗ
	|	Справочник.CRM_СостоянияИнтересов КАК СостоянияИнтересов
	|ГДЕ
	|	СостоянияИнтересов.Родитель = ЗНАЧЕНИЕ(Справочник.CRM_СостоянияИнтересов.ПустаяСсылка)
	|	И НЕ СостоянияИнтересов.ПометкаУдаления
	|	И ВЫБОР
	|			КОГДА &ЭтоПоддержка
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ НЕ СостоянияИнтересов.ЭтоПоддержка
	|		КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СостоянияИнтересовТипыОбращений.Ссылка
	|ИЗ
	|	Справочник.CRM_СостоянияИнтересов.ТипыОбращений КАК СостоянияИнтересовТипыОбращений
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.CRM_СостоянияИнтересов КАК СостоянияИнтересов
	|		ПО (СостоянияИнтересов.Ссылка = СостоянияИнтересовТипыОбращений.Ссылка)
	|ГДЕ
	|	СостоянияИнтересов.Родитель = ЗНАЧЕНИЕ(Справочник.CRM_СостоянияИнтересов.ПустаяСсылка)
	|	И НЕ СостоянияИнтересов.ПометкаУдаления
	|	И ВЫБОР
	|			КОГДА &ЭтоПоддержка
	|				ТОГДА СостоянияИнтересов.ЭтоПоддержка
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|	И СостоянияИнтересовТипыОбращений.ТипОбращения = &ТипОбращения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СостоянияИнтересов.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ДоступныеПоПодразделениямСостояния
	|ИЗ
	|	Справочник.CRM_СостоянияИнтересов КАК СостоянияИнтересов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.CRM_СостоянияИнтересов.Подразделения КАК ПодразделенияСостояний
	|		ПО СостоянияИнтересов.Ссылка = ПодразделенияСостояний.Ссылка
	|ГДЕ
	|	ЕСТЬNULL(ПодразделенияСостояний.Ссылка, ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|	И СостоянияИнтересов.Родитель = ЗНАЧЕНИЕ(Справочник.CRM_СостоянияИнтересов.ПустаяСсылка)
	|	И НЕ СостоянияИнтересов.ПометкаУдаления
	|	И СостоянияИнтересов.Ссылка В
	|			(ВЫБРАТЬ
	|				Т.Ссылка КАК Ссылка
	|			ИЗ
	|				ДоступныеПоТипуОбращенияСостояния КАК Т)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СостоянияИнтересов.Ссылка
	|ИЗ
	|	Справочник.CRM_СостоянияИнтересов КАК СостоянияИнтересов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.CRM_СостоянияИнтересов.Подразделения КАК ПодразделенияСостояний
	|		ПО СостоянияИнтересов.Ссылка = ПодразделенияСостояний.Ссылка
	|ГДЕ
	|	ПодразделенияСостояний.Подразделение В ИЕРАРХИИ(&Подразделение)
	|	И СостоянияИнтересов.Родитель = ЗНАЧЕНИЕ(Справочник.CRM_СостоянияИнтересов.ПустаяСсылка)
	|	И НЕ СостоянияИнтересов.ПометкаУдаления
	|	И СостоянияИнтересов.Ссылка В
	|			(ВЫБРАТЬ
	|				Т.Ссылка КАК Ссылка
	|			ИЗ
	|				ДоступныеПоТипуОбращенияСостояния КАК Т)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СостоянияИнтересов.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ДоступныеСостояния
	|ИЗ
	|	Справочник.CRM_СостоянияИнтересов КАК СостоянияИнтересов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.CRM_СостоянияИнтересов.ТипыУслуг КАК ТипыУслугСостояний
	|		ПО СостоянияИнтересов.Ссылка = ТипыУслугСостояний.Ссылка
	|ГДЕ
	|	ЕСТЬNULL(ТипыУслугСостояний.Ссылка, ЗНАЧЕНИЕ(Справочник.CRM_ТипУслуги.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.CRM_ТипУслуги.ПустаяСсылка)
	|	И СостоянияИнтересов.Ссылка В
	|			(ВЫБРАТЬ
	|				ДоступныеПоПодразделениямСостояния.Ссылка КАК Ссылка
	|			ИЗ
	|				ДоступныеПоПодразделениямСостояния)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СостоянияИнтересов.Ссылка
	|ИЗ
	|	Справочник.CRM_СостоянияИнтересов КАК СостоянияИнтересов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.CRM_СостоянияИнтересов.ТипыУслуг КАК ТипыУслугСостояний
	|		ПО СостоянияИнтересов.Ссылка = ТипыУслугСостояний.Ссылка
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ИспользоватьТипыУслуг
	|				ТОГДА ТипыУслугСостояний.ТипУслуги = &ТипУслуги
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И СостоянияИнтересов.Ссылка В
	|			(ВЫБРАТЬ
	|				ДоступныеПоПодразделениямСостояния.Ссылка КАК Ссылка
	|			ИЗ
	|				ДоступныеПоПодразделениямСостояния)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДоступныеСостояния.Ссылка КАК Ссылка
	|ИЗ
	|	ДоступныеСостояния КАК ДоступныеСостояния";
	
	Запрос.УстановитьПараметр("ТипУслуги", ПараметрыСценариев.ТипУслуги);
	Запрос.УстановитьПараметр("ИспользоватьТипыУслуг", ПараметрыСценариев.ИспользоватьТипыУслуг);
	Если ПараметрыСценариев.Свойство("Подразделение") Тогда
		Запрос.УстановитьПараметр("Подразделение", ПараметрыСценариев.Подразделение);
	ИначеЕсли ПараметрыСценариев.Свойство("Ответственный") Тогда
		Запрос.УстановитьПараметр("Подразделение",
			 CRM_ОбщегоНазначенияСервер.ПолучитьРеквизитОтветственного(ПараметрыСценариев.Ответственный,
			 "Подразделение"));
	КонецЕсли;
	Запрос.УстановитьПараметр("ТипОбращения", ПараметрыСценариев.ТипОбращения);
	Запрос.УстановитьПараметр("ЭтоПоддержка", ПараметрыСценариев.ЭтоПоддержка);
	
	Если ПараметрыСценариев.Свойство("ИсточникОбращения") Тогда
		ТипИсточникаОбращения = ТипЗнч(ПараметрыСценариев.ИсточникОбращения);
		Если ЗначениеЗаполнено(ПараметрыСценариев.ИсточникОбращения) И
			(ТипИсточникаОбращения = Тип("СправочникСсылка.CRM_ИсточникиПолученияЛидов")
				ИЛИ ТипИсточникаОбращения = Тип("СправочникСсылка.CRM_УчетныеЗаписиМессенджеров")
				ИЛИ ТипИсточникаОбращения = Тип("СправочникСсылка.УчетныеЗаписиЭлектроннойПочты")) Тогда
				
			ТемпДоступныеСценарии = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
			ДоступныеСценарии.ЗагрузитьЗначения(CRM_ОбщегоНазначенияКлиентСервер.ПересечениеМножеств(ТемпДоступныеСценарии,
				ПараметрыСценариев.ИсточникОбращения.CRM_Сценарии.ВыгрузитьКолонку("Сценарий"))); 
		КонецЕсли;
	КонецЕсли;
	Если ДоступныеСценарии.Количество() = 0 Тогда
		ДоступныеСценарии.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	КонецЕсли;

	Если Не ПараметрыСценариев.ЭтоПоддержка И ПараметрыСценариев.ДоступныКарты Тогда
		
		Карты = CRM_БизнесПроцессыСервер.ВернутьСпискиДоступныхКарт(Истина);
		
		Для Каждого ЭлементСписка Из Карты Цикл
			ДоступныеСценарии.Добавить(ЭлементСписка.Значение, Строка(ЭлементСписка.Значение), ,
				 БиблиотекаКартинок.CRM_ПодсистемаБизнесПроцессы_Такси);
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат ДоступныеСценарии;
	
КонецФункции

Функция НастройкаСоставаРеквизитовПоУмолчанию() Экспорт
	
	Настройки = Новый Структура;
	ОбщиеНастройки = Новый Структура;
	
	НастраиваемыеРеквизиты = Новый СписокЗначений;
	НастраиваемыеРеквизиты.Добавить("ОжидаемаяВыручка", НСтр("ru = 'Ожидаемая выручка'"), Истина);
	НастраиваемыеРеквизиты.Добавить("ОжидаемаяДатаПродажи", НСтр("ru = 'Ожидаемая дата продажи'"), Истина);
	НастраиваемыеРеквизиты.Добавить("Проект");
	НастраиваемыеРеквизиты.Добавить("ОсновнаяОрганизация", НСтр("ru = 'Организация'"));
	Если CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM() Тогда
		НастраиваемыеРеквизиты.Добавить("Договор");
	Иначе
		НастраиваемыеРеквизиты.Добавить("Соглашение");
		НастраиваемыеРеквизиты.Добавить("Контрагент");
		НастраиваемыеРеквизиты.Добавить("Договор");
	КонецЕсли;
	НастраиваемыеРеквизиты.Добавить("РольВИнтересе", НСтр("ru = 'Роль контакта'"));
	ОбщиеНастройки.Вставить("Интерес", НастраиваемыеРеквизиты);
	
	НастраиваемыеРеквизиты = Новый СписокЗначений;
	НастраиваемыеРеквизиты.Добавить("Клиент_ОбъектНаименованиеПолное", НСтр("ru = 'Публичное наименование'"));
	НастраиваемыеРеквизиты.Добавить("ГруппаКлиентИНН", НСтр("ru = 'ИНН'"), Истина);
	НастраиваемыеРеквизиты.Добавить("Клиент_ОбъектCRM_КодПоОКПО", НСтр("ru = 'ОКПО'"));
	Если CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM() Тогда
		НастраиваемыеРеквизиты.Добавить("Клиент_ОбъектCRM_ГоловнаяОрганизация", НСтр("ru = 'Головная организация'"));
	КонецЕсли;
	НастраиваемыеРеквизиты.Добавить("Клиент_ОбъектРодитель",
		?(CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM(), НСтр("ru = 'Группа'"), НСтр("ru = 'Головное предприятие'")));
	НастраиваемыеРеквизиты.Добавить("Клиент_ОбъектCRM_ОсновнаяОтрасль", НСтр("ru = 'Отрасль'"));
	НастраиваемыеРеквизиты.Добавить("Клиент_ОбъектCRM_СегментРынка", НСтр("ru = 'Сегмент рынка'"));
	НастраиваемыеРеквизиты.Добавить("Клиент_ОбъектCRM_Важность", НСтр("ru = 'Важность'"));
	НастраиваемыеРеквизиты.Добавить("Клиент_ОбъектCRM_СтатусРаботы", НСтр("ru = 'Статус работы'"));
	НастраиваемыеРеквизиты.Добавить("Клиент_ОбъектОсновнойМенеджер", НСтр("ru = 'Ответственный'"));
	НастраиваемыеРеквизиты.Добавить("ГруппаТипыОтношений", НСтр("ru = 'Тип отношений'"), Истина);
	НастраиваемыеРеквизиты.Добавить("Клиент_ОбъектБизнесРегион", НСтр("ru = 'Бизнес-регион'"));
	НастраиваемыеРеквизиты.Добавить("Клиент_Адрес", НСтр("ru = 'Адрес'"));
	НастраиваемыеРеквизиты.Добавить("Клиент_ЮрАдрес", НСтр("ru = 'Юридический адрес'"));
	НастраиваемыеРеквизиты.Добавить("Клиент_ОбъектПол", НСтр("ru = 'Пол'"));
	НастраиваемыеРеквизиты.Добавить("Клиент_ОбъектДатаРождения", НСтр("ru = 'Дата рождения'"));
	НастраиваемыеРеквизиты.Добавить("Клиент_ОбъектКомментарий", НСтр("ru = 'Комментарий'"));
	ОбщиеНастройки.Вставить("Клиент", НастраиваемыеРеквизиты);
	
	НастраиваемыеРеквизиты = Новый СписокЗначений;
	НастраиваемыеРеквизиты.Добавить("Должность", , Истина);
	НастраиваемыеРеквизиты.Добавить("СтатусКЛ", НСтр("ru = 'Статус'"));
	НастраиваемыеРеквизиты.Добавить("РольКонтактногоЛица", НСтр("ru = 'Роль'"));
	НастраиваемыеРеквизиты.Добавить("ПолКонтактногоЛица", НСтр("ru = 'Пол'"));
	НастраиваемыеРеквизиты.Добавить("ДатаРожденияКЛ", НСтр("ru = 'Дата рождения'"));
	НастраиваемыеРеквизиты.Добавить("Контакт_Описание", НСтр("ru = 'Описание'"));
	ОбщиеНастройки.Вставить("Контакт", НастраиваемыеРеквизиты);
	
	НастраиваемыеРеквизиты = Новый СписокЗначений;
	НастраиваемыеРеквизиты.Добавить("Должность1", НСтр("ru = 'Должность'"));
	НастраиваемыеРеквизиты.Добавить("Отрасль");
	НастраиваемыеРеквизиты.Добавить("БизнесРегион", НСтр("ru = 'Бизнес регион'"));
	НастраиваемыеРеквизиты.Добавить("РодительПК", НСтр("ru = 'Группа'"));
	ОбщиеНастройки.Вставить("ПотенциальныйКлиент", НастраиваемыеРеквизиты);
	
	Настройки.Вставить("ОбщиеНастройки", ОбщиеНастройки);
	
	Возврат Настройки;
	
КонецФункции

Функция СответствиеЭлементовМастераИИнтереса() Экспорт
	
	Соответствие = Новый Структура;
	
	Соответствие.Вставить("Должность", "Контакт_ОбъектCRM_Должность");
	Соответствие.Вставить("СтатусКЛ", "Контакт_Статус");
	Соответствие.Вставить("РольКонтактногоЛица", "Контакт_ОбъектCRM_РольКонтактногоЛица");
	Соответствие.Вставить("ПолКонтактногоЛица", "Контакт_ОбъектПол");
	Соответствие.Вставить("ДатаРожденияКЛ", "Контакт_ОбъектДатаРождения");
	Соответствие.Вставить("Контакт_Описание", "Контакт_ОбъектКомментарий");
	
	Возврат Соответствие;
	
КонецФункции

Функция ВариантыНазначенияОтветственного() Экспорт
	
	МассивСтруктур = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("CRM_МастерРегистрацииОбращения.НазначениеОтветственного",
		 "МастерРегистрации",
		 Неопределено);
	
	ТаблицаИсточник = Неопределено;	 
	Если МассивСтруктур = Неопределено Тогда
		ТаблицаИсточник = ВариантыНазначенияОтветственногоПоУмолчанию();
	Иначе
		ТаблицаИсточник = CRM_РабочийСтолСервер.МассивСтруктурВТаблицуЗначений(МассивСтруктур);
	КонецЕсли;
	
	Возврат ТаблицаИсточник;
	
КонецФункции

Функция ВариантыНазначенияОтветственногоПоУмолчанию(ПодставлятьОтветственногоЗаКлиентаВИнтерес = Ложь) Экспорт
	
	Таблица = Новый ТаблицаЗначений;
	
	Таблица.Колонки.Добавить("Вариант", Новый ОписаниеТипов("ПеречислениеСсылка.CRM_ВариантыНазначенияОтветственного"));
	Таблица.Колонки.Добавить("Используется", Новый ОписаниеТипов("Булево"));
	
	Если ПодставлятьОтветственногоЗаКлиентаВИнтерес Тогда
		НС = Таблица.Добавить();
		НС.Вариант = Перечисления.CRM_ВариантыНазначенияОтветственного.МенеджерКлиента;
		НС.Используется = Истина;	
	КонецЕсли;
	
	НС = Таблица.Добавить();
	НС.Вариант = Перечисления.CRM_ВариантыНазначенияОтветственного.ПерсональнаяНастройка;
	НС.Используется = Истина;	
	
	НС = Таблица.Добавить();
	НС.Вариант = Перечисления.CRM_ВариантыНазначенияОтветственного.ТекущийПользователь;
	НС.Используется = Истина;	
	
	Если НЕ ПодставлятьОтветственногоЗаКлиентаВИнтерес Тогда
		НС = Таблица.Добавить();
		НС.Вариант = Перечисления.CRM_ВариантыНазначенияОтветственного.МенеджерКлиента;
		НС.Используется = Ложь;	
	КонецЕсли;
	
	НС = Таблица.Добавить();
	НС.Вариант = Перечисления.CRM_ВариантыНазначенияОтветственного.РольСценария;
	НС.Используется = Ложь;	
	
	НС = Таблица.Добавить();
	НС.Вариант = Перечисления.CRM_ВариантыНазначенияОтветственного.ОтветственныйОбращения;
	НС.Используется = Ложь;
	
	Возврат Таблица;
	
КонецФункции

#КонецОбласти

#КонецЕсли
